
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТекстТеста") И Не ПустаяСтрока(Параметры.ТекстТеста) Тогда
		// BSLLS:ExecuteExternalCode-off
		Выполнить(Параметры.ТекстТеста);
		// BSLLS:ExecuteExternalCode-on
	КонецЕсли;
	
КонецПроцедуры

// BSLLS:ServerSideExportFormMethod-off
&НаСервере
Функция ПолучитьДействиеЭлементаФормы(ИмяЭлемента, Обработчик) Экспорт
	
	Возврат Элементы[ИмяЭлемента].ПолучитьДействие(Обработчик);
	
КонецФункции

&НаСервере
Функция ПолучитьЗаголовокКомандыФормы(ИмяКоманды) Экспорт
	
	Возврат Команды[ИмяКоманды].Заголовок;
	
КонецФункции

&НаСервере
Функция РеквизитФормыСодержитТип(ИмяРеквизита, ИмяТипа) Экспорт
	
	Для Каждого РеквизитФормы Из ПолучитьРеквизиты() Цикл
		Если РеквизитФормы.Имя = ИмяРеквизита Тогда
			Возврат РеквизитФормы.ТипЗначения.СодержитТип(Тип(ИмяТипа));
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции
// BSLLS:ServerSideExportFormMethod-on
