#Область ПрограммныйИнтерфейс

// Инициализирует механизм изменения реквизитов и элементов для конкретной формы
//
// Параметры:
//    Форма - Форма - форма в которую предполагается добавлять новые элементы
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - обработка которая содеожит в себе информацию об изменениях
//                                      и осуществляет непосредственное изменение формы
//
Функция НовыйПостроительФорм(Форма) Экспорт
	
	Обработка = Обработки.рсф_ПостроительФорм.Создать();
	Обработка.Инициализация(Форма);
	
	Возврат Обработка;
	
КонецФункции

// Создает описание таблицы значений и соответствующего ей элемента формы.
//
// Параметры:
//    Имя                         - Строка - имя реквизита формы с типом ТаблицаЗначений.
//    Представление               - Строка - заголовок таблицы формы.
//    Родитель                    - Строка - имя родительского элемента формы.
//    ПереопределитьКоманднуюПанель - Булево - признак создания отдельной командной панели таблицы.
//
// Возвращаемое значение:
//    Структура - описание таблицы.
//
Функция ОписаниеТаблицы(Имя, Представление, Родитель, ПереопределитьКоманднуюПанель = Ложь) Экспорт
	
	Возврат Обработки.рсф_Таблицы.ОписаниеТаблицы(Имя, Представление, Родитель, ПереопределитьКоманднуюПанель);
	
КонецФункции

// Создает описание реквизита таблицы значений и соответствующей ему колонки таблицы формы.
//
// Параметры:
//    Имя           - Строка        - имя реквизита таблицы значений.
//    Представление - Строка        - заголовок колонки таблицы формы.
//    Тип            - ОписаниеТипов - тип реквизита таблицы значений.
//
// Возвращаемое значение:
//    Структура - описание реквизита таблицы.
//
Функция ОписаниеРеквизитаТаблицы(Имя, Представление, Тип) Экспорт
	
	Возврат Обработки.рсф_Таблицы.ОписаниеРеквизитаТаблицы(Имя, Представление, Тип);
	
КонецФункции

#КонецОбласти
