#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Параметры:
//    Имя                           - Строка - имя реквизита формы с типом ТаблицаЗначений.
//    Представление                 - Строка - заголовок таблицы формы.
//    Родитель                      - Строка - имя родительского элемента формы.
//    ПереопределитьКоманднуюПанель - Булево - признак создания отдельной командной панели таблицы.
//
// Возвращаемое значение:
//    Структура - описание таблицы
//
Функция ОписаниеТаблицы(Имя, Заголовок, Родитель, ПереопределитьКоманднуюПанель = Ложь) Экспорт
	
	Описание = Новый Структура;
	Описание.Вставить("Имя",                           Имя);
	Описание.Вставить("Заголовок",                     Заголовок);
	Описание.Вставить("Родитель",                      Родитель);
	Описание.Вставить("ПереопределитьКоманднуюПанель", ПереопределитьКоманднуюПанель);
	Описание.Вставить("Реквизиты",                     Новый Массив);
	
	Возврат Описание;
	
КонецФункции

// Параметры:
//    Имя            - Строка        - имя реквизита таблицы значений.
//    Представление  - Строка        - заголовок колонки таблицы формы.
//    Тип            - ОписаниеТипов - тип реквизита таблицы значений.
//
// Возвращаемое значение:
//    Структура - описание реквизита таблицы.
//
Функция ОписаниеРеквизитаТаблицы(Имя, Заголовок, Тип) Экспорт
	
	ОписаниеРеквизита = Новый Структура;
	ОписаниеРеквизита.Вставить("Имя",       Имя);
	ОписаниеРеквизита.Вставить("Заголовок", Заголовок);
	ОписаниеРеквизита.Вставить("Тип",       Тип);
	
	Возврат ОписаниеРеквизита;
	
КонецФункции

#КонецОбласти

#КонецЕсли